Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
         + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-alb-prod-https-ingress-0.0.0.0-0"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + tags_all               = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for Atlantis Application Load Balancer"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-alb-prod-https-ingress-0.0.0.0-0"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + to_port                = 443
    }

  # module.atlantis_ecr.aws_ecr_lifecycle_policy.this[0] will be created
+ resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 10 tagged images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 10
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Delete untagged images after 7 days"
                      + rulePriority = 2
                      + selection    = {
                          + countNumber = 7
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "atlantis"
    }

  # module.atlantis_ecr.aws_ecr_repository.this will be created
+ resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "atlantis"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Component"   = "container-registry"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Description" = "Docker images for Atlantis Terraform automation server"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "ecr-atlantis"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + tags_all             = {
          + "Component"   = "container-registry"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Description" = "Docker images for Atlantis Terraform automation server"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "ecr-atlantis"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }

      + encryption_configuration {
          + encryption_type = "KMS"
          + kms_key         = "arn:aws:kms:ap-northeast-2:646886795421:key/fb74c860-dfb9-498f-9937-976a098b103c"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.atlantis_ecr.aws_ecr_repository_policy.this[0] will be created
+ resource "aws_ecr_repository_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:PutImage",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:UploadLayerPart",
                          + "ecr:CompleteLayerUpload",
                          + "ecr:DescribeImages",
                          + "ecr:ListImages",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::646886795421:root"
                        }
                      + Sid       = "AllowPushPull"
                    },
                  + {
                      + Action    = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = "AllowECSTaskExecution"
                    },
                ]
              + Version   = "2008-10-17"
            }
        )
      + registry_id = (known after apply)
      + repository  = "atlantis"
    }

  # module.atlantis_ecr.aws_ssm_parameter.repository-url[0] will be created
+ resource "aws_ssm_parameter" "repository-url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "ECR repository URL for atlantis"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/shared/ecr/atlantis-repository-url"
      + tags           = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Description" = "Docker images for Atlantis Terraform automation server"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + tags_all       = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Description" = "Docker images for Atlantis Terraform automation server"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.atlantis_ecs_tasks_sg.aws_security_group.this will be created
+ resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Security group for Atlantis ECS tasks"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "atlantis-ecs-tasks-prod"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for Atlantis ECS tasks"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-ecs-tasks-prod"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
          + "Type"        = "custom"
        }
      + tags_all               = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for Atlantis ECS tasks"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-ecs-tasks-prod"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
          + "Type"        = "custom"
        }
      + vpc_id                 = "vpc-0f162b9e588276e09"
    }

  # module.atlantis_ecs_tasks_sg.aws_vpc_security_group_egress_rule.default[0] will be created
+ resource "aws_vpc_security_group_egress_rule" "default" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all outbound traffic"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for Atlantis ECS tasks"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-ecs-tasks-prod-default-egress"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + tags_all               = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for Atlantis ECS tasks"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-ecs-tasks-prod-default-egress"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
    }

  # module.atlantis_ecs_tasks_sg.aws_vpc_security_group_ingress_rule.custom["0"] will be created
+ resource "aws_vpc_security_group_ingress_rule" "custom" {
      + arn                          = (known after apply)
      + description                  = "Allow traffic from ALB to ECS container"
      + from_port                    = 4141
      + id                           = (known after apply)
      + ip_protocol                  = "tcp"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags                         = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for Atlantis ECS tasks"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-ecs-tasks-prod-custom-ingress-0"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + tags_all                     = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for Atlantis ECS tasks"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-ecs-tasks-prod-custom-ingress-0"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + to_port                      = 4141
    }

  # module.atlantis_efs_sg.aws_security_group.this will be created
+ resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Security group for Atlantis EFS mount targets"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "atlantis-efs-prod"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for Atlantis EFS mount targets"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-efs-prod"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
          + "Type"        = "custom"
        }
      + tags_all               = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for Atlantis EFS mount targets"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-efs-prod"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
          + "Type"        = "custom"
        }
      + vpc_id                 = "vpc-0f162b9e588276e09"
    }

  # module.atlantis_efs_sg.aws_vpc_security_group_egress_rule.default[0] will be created
+ resource "aws_vpc_security_group_egress_rule" "default" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all outbound traffic"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for Atlantis EFS mount targets"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-efs-prod-default-egress"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + tags_all               = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for Atlantis EFS mount targets"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-efs-prod-default-egress"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
    }

  # module.atlantis_efs_sg.aws_vpc_security_group_ingress_rule.custom["0"] will be created
+ resource "aws_vpc_security_group_ingress_rule" "custom" {
      + arn                          = (known after apply)
      + description                  = "NFS from ECS tasks"
      + from_port                    = 2049
      + id                           = (known after apply)
      + ip_protocol                  = "tcp"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags                         = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for Atlantis EFS mount targets"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-efs-prod-custom-ingress-0"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + tags_all                     = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for Atlantis EFS mount targets"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-efs-prod-custom-ingress-0"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + to_port                      = 2049
    }

  # module.atlantis_logs.aws_cloudwatch_log_group.this will be created
+ resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/atlantis-prod/application"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Component"     = "log-group"
          + "CostCenter"    = "engineering"
          + "DataClass"     = "confidential"
          + "Description"   = "CloudWatch log group for Atlantis ECS tasks"
          + "Environment"   = "prod"
          + "ExportToS3"    = "disabled"
          + "KMSEncrypted"  = "false"
          + "LangfuseSync"  = "disabled"
          + "Lifecycle"     = "production"
          + "LogType"       = "application"
          + "ManagedBy"     = "terraform"
          + "Name"          = "/aws/ecs/atlantis-prod/application"
          + "Owner"         = "platform-team"
          + "Project"       = "infrastructure"
          + "RetentionDays" = "7"
          + "SentrySync"    = "disabled"
          + "Service"       = "atlantis"
        }
      + tags_all          = {
          + "Component"     = "log-group"
          + "CostCenter"    = "engineering"
          + "DataClass"     = "confidential"
          + "Description"   = "CloudWatch log group for Atlantis ECS tasks"
          + "Environment"   = "prod"
          + "ExportToS3"    = "disabled"
          + "KMSEncrypted"  = "false"
          + "LangfuseSync"  = "disabled"
          + "Lifecycle"     = "production"
          + "LogType"       = "application"
          + "ManagedBy"     = "terraform"
          + "Name"          = "/aws/ecs/atlantis-prod/application"
          + "Owner"         = "platform-team"
          + "Project"       = "infrastructure"
          + "RetentionDays" = "7"
          + "SentrySync"    = "disabled"
          + "Service"       = "atlantis"
        }
    }

  # module.atlantis_task_execution_role.aws_iam_role.this will be created
+ resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "ECS task execution role for Atlantis"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "atlantis-ecs-task-execution-prod"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Description" = "ECS task execution role for Atlantis"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-ecs-task-execution-prod"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + tags_all              = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Description" = "ECS task execution role for Atlantis"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-ecs-task-execution-prod"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + unique_id             = (known after apply)
    }

  # module.atlantis_task_role.aws_iam_role.this will be created
+ resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "ECS task role for Atlantis Terraform operations"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "atlantis-ecs-task-prod"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Description" = "ECS task role for Atlantis Terraform operations"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-ecs-task-prod"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + tags_all              = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Description" = "ECS task role for Atlantis Terraform operations"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-ecs-task-prod"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + unique_id             = (known after apply)
    }

  # module.vpc_endpoints_sg.aws_security_group.this will be created
+ resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Security group for VPC Interface Endpoints"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "vpc-endpoint-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Component"   = "vpc-endpoints"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for VPC Interface Endpoints"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "vpc-endpoint-sg"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
          + "Type"        = "vpc-endpoint"
        }
      + tags_all               = {
          + "Component"   = "vpc-endpoints"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for VPC Interface Endpoints"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "vpc-endpoint-sg"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
          + "Type"        = "vpc-endpoint"
        }
      + vpc_id                 = "vpc-0f162b9e588276e09"
    }

  # module.vpc_endpoints_sg.aws_vpc_security_group_ingress_rule.vpc-endpoint-cidr["10.0.0.0/16"] will be created
+ resource "aws_vpc_security_group_ingress_rule" "vpc-endpoint-cidr" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "10.0.0.0/16"
      + description            = "Allow traffic from CIDR block to VPC endpoint"
      + from_port              = 443
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Component"   = "vpc-endpoints"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for VPC Interface Endpoints"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "vpc-endpoint-sg-cidr-ingress-10.0.0.0/16"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + tags_all               = {
          + "Component"   = "vpc-endpoints"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for VPC Interface Endpoints"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "vpc-endpoint-sg-cidr-ingress-10.0.0.0/16"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + to_port                = 443
    }

Plan: 29 to add, 15 to change, 23 to destroy.

Changes to Outputs:
~ atlantis_alb_arn                     = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:loadbalancer/app/atlantis-prod/665f4d0af1d0e39d" -> (known after apply)
~ atlantis_alb_dns_name                = "atlantis-prod-965898050.ap-northeast-2.elb.amazonaws.com" -> (known after apply)
~ atlantis_alb_security_group_id       = "sg-02b0ffd94dd79e5a4" -> (known after apply)
~ atlantis_alb_zone_id                 = "ZWKZPGTI48KDX" -> (known after apply)
+ atlantis_cloudwatch_log_group_arn    = (known after apply)
~ atlantis_cloudwatch_log_group_name   = "/ecs/atlantis-prod" -> "/aws/ecs/atlantis-prod/application"
~ atlantis_ecr_repository_arn          = "arn:aws:ecr:ap-northeast-2:646886795421:repository/atlantis" -> (known after apply)
~ atlantis_ecr_repository_url          = "646886795421.dkr.ecr.ap-northeast-2.amazonaws.com/atlantis" -> (known after apply)
~ atlantis_ecs_task_execution_role_arn = "arn:aws:iam::646886795421:role/atlantis-ecs-task-execution-prod" -> (known after apply)
~ atlantis_ecs_task_role_arn           = "arn:aws:iam::646886795421:role/atlantis-ecs-task-prod" -> (known after apply)
~ atlantis_ecs_tasks_security_group_id = "sg-09eda99303e72ca2d" -> (known after apply)
~ atlantis_target_group_arn            = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:targetgroup/atl-20251011072359287200000001/2c46e9934484e453" -> (known after apply)
+ atlantis_target_group_arns           = {
      + atlantis = (known after apply)
    }
~ atlantis_task_definition_arn         = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/atlantis-prod:8" -> (known after apply)
~ atlantis_task_definition_revision    = 8 -> (known after apply)
~ vpc_endpoint_sg_id                   = "sg-08366fa4751299ef2" -> (known after apply)

```
</details>